Revit 2027 API
BuiltInFailures.PartMakerMethodForMergePartFailures.PartNotIncludedInMerge Property
 This part is not geometrically coincident with another part of the same material. No merge possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartNotIncludedInMerge { get; }
Public Shared ReadOnly Property PartNotIncludedInMerge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartNotIncludedInMerge {
	FailureDefinitionId^ get ();
}
static member PartNotIncludedInMerge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace